import { Answer, Question } from "@/types/Question";

export const answers: Array<Answer> = [
  { text: "شدیدا متنفرم", value: 1 },
  { text: "متنفرم", value: 2 },
  { text: "تقریبا متنفرم", value: 3 },
  { text: "احساس خاصی ندارم", value: 4 },
  { text: "تقریبا علاقه مندم", value: 5 },
  { text: "علاقه مندم", value: 6 },
  { text: "شدیدا علاقه مندم", value: 7 },
];
export const questions: Array<Question> = [
  {
    row: 1,
    title: "مدیر خدمات اجتماعی",
    question:
      "مدیریت خدمات اجتماعی برای ترغیب مردم در دستیابی به یک زندگی کاملتر و غنی تر",
  },
  {
    row: 2,
    title: "تحویلدار بانک",
    question:
      "فعالیت در امور بانکی مثل دریافت و پرداخت پول، افتتاح و مدیریت حسابهای سپرده گذاری",
  },
  {
    row: 3,
    title: "تحلیلگر مالی",
    question:
      "انجام تجزیه و تحلیل اطلاعات مالی موثر بر برنامه های سرمایه گذاری موسسه های عمومی یا خصوصی",
  },
  {
    row: 4,
    title: "مدیر نیروگاه برق",
    question:
      "سازماندهی فعالیتهای کارمندان و فعالیتها در بخشهای مختلف یک نیروگاه برق:",
  },
  {
    row: 5,
    title: "مکانیک هواپیما",
    question: "تعمیر یا معاینه کارکرد قطعات مختلف هواپیما::",
  },
  {
    row: 6,
    title: "بوم شناس",
    question:
      "بررسی روابط بین موجودات زنده و همچنین روابط بین موجودات زنده با محیط پیرامون",
  },
  {
    row: 7,
    title: "پیکر تراش",
    question:
      "طراحی کارهای هنری سه بعدی، با مدلسازی و با اتصال یا ترکیب مواد مختلف و یا حکاکی",
  },
  {
    row: 8,
    title: "مشاور مدرسه",
    question:
      "مشاوره با دانش آموزان برای حل مسایل تحصیلی آنها  بر مبنای علوم روانشناختی",
  },
  {
    row: 9,
    title: "مدیر کارگزینی",
    question: "استخدام، سازماندهی، و مدیریت عملکرد کارکنان یک سازمان یا شرکت",
  },
  {
    row: 10,
    title: "مدیر اداره",
    question:
      "سازماندهی و انسجام فعالیتهای کارمندان و عملیات ها و  اقدامات در بخشهای مختلف یک اداره:",
  },
  {
    row: 11,
    title: "بازرس بانک",
    question: "کنترل و تجزیه و تحلیل پرونده ها و اسناد حسابداری بانک ها",
  },
  {
    row: 12,
    title: "تکنسین برق",
    question:
      "طراحی، ساخت، تست، مشکل زدایی، تعمیر، و اصلاح اجزا، قسمتها، تجهیزات، و سیستمهای الکتریکی",
  },
  {
    row: 13,
    title: "تعمیرکار وسایل نقلیه",
    question: "تشخیص مشکلات، تنظیم، تعمیر، یا بازدید کامل وسایل نقلیه",
  },
  {
    row: 14,
    title: "جنگلبان",
    question:
      "نگهداری از زمینهایی واقع در محدوده جنگل شناخته شده اند، با اهداف اقتصادی، تفریحی، و حفظ بقای منابع:",
  },
  {
    row: 15,
    title: "نوازنده",
    question:
      "اجرای ابزارهای موسیقی به صورت تکنواز یا به عنوان عضو یا یک هنر مند میهمان در یک گروه موسیقی",
  },
  {
    row: 16,
    title: "گفتار درمانگر",
    question: "سنجش و درمان مشکلات مربوط به تکلم و شنوایی:",
  },
  {
    row: 17,
    title: "مدیر تبلیغات",
    question:
      "طراحی  برنامه تبلیغاتی برای ایجاد و حفظ یک تصویر مطلوب از برنامه ها، افراد، کالاها، یا خدمات خاص:",
  },
  {
    row: 18,
    title: "مدیر مجتمع فروشگاهی",
    question:
      "نظارت، هدایت و هماهنگی تمام فروشندگان و فعالیتهای خطوط فروش یک مجتمع فروشگاهی:",
  },
  {
    row: 19,
    title: "بانکدار",
    question:
      "ارائه خدمات بانکی ویژه برای مشتریان، شامل: طرح ریزی های مالی، مدیریت سپرده گذاری و:::",
  },
  {
    row: 20,
    title: "تکنسین میکروالکترونیک",
    question: "انجام فعالیتهایی همچون  طراحی مدارهای الکترونیکی",
  },
  {
    row: 21,
    title: "تکنسین ارتباطات هوایی",
    question:
      "نصب، کنترل، یا تعمیر تجهیزات هوایی از قبیل رادار، سیستم کنترل موشک در هواپیما",
  },
  {
    row: 22,
    title: "اقیانوس شناس",
    question:
      "مطالعه ویژگی های فیزیکی اقیانوسها و بستر اقیانوسها و چگونگی تاثیر این ویژگی ها بر  و آب و هوا",
  },
  {
    row: 23,
    title: "آهنگ ساز",
    question:
      "خلق موسیقی اصیل یا نوشتن فرمهای مخصوص موسیقی نظیر سونات، سمفونی، اپرا",
  },
  {
    row: 24,
    title: "مددکار اجتماعی",
    question:
      "کمک به افراد در درمان مشکلات رفتاری همچون اعتیاد یا پیشگیری از این مشکلات",
  },
  {
    row: 25,
    title: "فروشنده پوشاک",
    question: "فروش مدلهای گوناگون پوشاک به مشتریان",
  },
  {
    row: 26,
    title: "متصدی حراج (کل فروش)",
    question: "فروش کالا ها به صورت عمده به فروشگاه های جزئی:",
  },
  {
    row: 27,
    title: "قیمت گذار اجناس",
    question: "برآورد قیمت محصولات کارخانه ای، پروژه های ساختمانی، یا خدمات",
  },
  {
    row: 28,
    title: "برقکار",
    question: "نصب، محافظت، و تعمیر اتصالات، تجهیزات، و لوازم الکتریکی",
  },
  {
    row: 29,
    title: "مهندس صنایع شیمیایی",
    question:
      "طراحی تجهیزات و فرایند تولید محصولات شیمیایی کارخانه ای مثل بنزین و مواد شوینده",
  },
  {
    row: 30,
    title: "طبیعت شناس",
    question:
      "آموزش علوم مربوط به منابع طبیعی برای افزایش تعهد مردم به طبیعت، و آموزش کارآموزان طبیعت شناسی:",
  },
  {
    row: 31,
    title: "شاعر",
    question:
      "نوشتن اشعار داستانی، دراماتیک، غنائی برای روزنامه، مجله، کتاب، تلویزیون، یا سایر رسانه ها:",
  },
  {
    row: 32,
    title: "کودکیار",
    question:
      "کمک به کودکان با انجام فعالیتهایی چون لباس پوشیدن، استحمام، غذا دادن، یا نظارت هنگام بازی",
  },
  {
    row: 33,
    title: "مدیر آژانس مسافرتی",
    question:
      "طراح ریزی برنامه سفر، و تدبیر وسایل و سایر خدمات مسافرتی برای مشتریان آژانس مسافرتی",
  },
  {
    row: 34,
    title: "مدیر فروش",
    question:
      "هدایت جریان حقیقی توزیع و جابجایی  کالا یا خدمات تا هنگام رسیدن به دست مشتریان",
  },
  {
    row: 35,
    title: "حسابدار قسم خورده",
    question:
      "ارائه خدمات پیچیده حسابداری به افراد یا شرکتهای کوچک یا بزرگ در  زمینه های مالی",
  },
  {
    row: 36,
    title: "مهندس برق",
    question:
      "طرح ریزی، نصب، توسعه، آزمایش، یا نظارت بر تجهیزات و سیستم ها برقی",
  },
  {
    row: 37,
    title: "تکنسین آزمایشگاه شیمی",
    question:
      "آزمایش شیمیایی و فیزیکی بر انواع مواد با اهدافی مثل کنترل کیفیت یا تشخیص بیماری 38. شکاربان یا مامور شیلات: مطالعه و محافظت از حیوانات وحشی یا ماهیهای موجود در یک منطقه محافظت شده",
  },
  {
    row: 39,
    title: "نمایشنامه نویس",
    question:
      "نوشتن فیلمنامه های اصیل و یا نوشتن نمایشنامه با بهره گیری از منابع افسانه ای، تاریخی، یا داستانی:",
  },
  {
    row: 40,
    title: "خانواده درمانگر",
    question:
      "تشخیص و درمان اختلالات، شناختی، عاطفی، هیجانی، یا رفتاری در نظام ازدواج و خانواده:",
  },
  {
    row: 41,
    title: "مربی ایروبیک (ورزش هوازی)",
    question:
      "تعلیم و آماده سازی افراد یا گروه ها در فعالیتهای ورزشی و مهارتهای اصولی ورزش",
  },
  {
    row: 42,
    title: "مدیر هتل",
    question:
      "نظارت، هدایت، و هماهنگی فعالیتهای روزانه هتل، به منظور اطمینان از رعایت کیفیت کاری هتل",
  },
  {
    row: 43,
    title: "متصدی حسابداری",
    question:
      "انجام آمیزه ای از وظایف محاسبات، ثبت، و بازیابی داده های مالی جهت استفاده در بایگانی",
  },
  {
    row: 44,
    title: "مونتاژگر لوازم الکتریکی",
    question:
      "اجرای آمیزه ای از وظایف برای مونتاژ کردن اجزا، محصولات، و سیستم های الکتریکی",
  },
  {
    row: 45,
    title: "ماشین چی",
    question:
      "نصب، تعمیر، و بکار انداختن طیف گوناگونی از ادوات ماشینی برای تولید وسایل و اجزای ظریف و دقیق:",
  },
  {
    row: 46,
    title: "دامپزشک",
    question: "تشخیص و درمان بیماری ها و اختلالات در حیوانات:",
  },
  {
    row: 47,
    title: "نویسنده",
    question:
      "ابداع و تهیه مواد مکتوب، از قبیل: داستان، آگهی های تبلیغاتی، و::",
  },
  {
    row: 48,
    title: "روانشناس آموزشی",
    question:
      "بررسی فرایند یادگیری و آموزش و توسعه اصول و فنون روانشناختی برای مشکلات آموزشی",
  },
  {
    row: 49,
    title: "روانشناس بالینی",
    question: "سنجش، تشخیص، و درمان افراد مبتلا به اختلالات روانی و هیجانی",
  },
  {
    row: 50,
    title: "مدیر پژوهشهای علمی",
    question:
      "سازماندهی، نظارت، هدایت، و هماهنگی افراد، فعالیتها، و برنامه ها در پروژه های پژوهشی:",
  },
  {
    row: 51,
    title: "متخصص کامپیوتر تجاری",
    question:
      "نصب و محافظت از سیستم های کامپیوتری شبکه ای و تجهیزات جانبی  مرتبط با آن",
  },
  {
    row: 52,
    title: "معمار",
    question:
      "طراحی  ساختمانها  مانند و خانه ها ،اماکن خصوصی، خوابگاهها، اداره ها،مدارس، و سالن تئاتر",
  },
  {
    row: 53,
    title: "پیشخدمت",
    question:
      "تمیزو مرتب نگهداشتن فضا در خانه ها شخصی، هتل، ساختمانهای تجاری، رستورانها، و بیمارستان ها:",
  },
  {
    row: 54,
    title: "مهماندار هواپیما",
    question:
      "ارائه خدماتی  مثل: پذیرایی، تشریح نحوه استفاده از تجهیزات ایمنی، توزیع غذا یا نوشیدنی در هواپیما",
  },
  {
    row: 55,
    title: "مشاور بودجه",
    question:
      "انجام مشاوره مالی برای افراد بدهکار، کم درآمد و افراد متمایل به زندگی مالی بهتر",
  },
  {
    row: 56,
    title: "دانشمند علوم اجتماعی",
    question:
      "انجام پژوهش و مطالعه بر مردم، برای كشف منطق رفتار انسان و روابط بین افراد و گروه ها",
  },
  {
    row: 57,
    title: "راننده بولدوزر",
    question:
      "راه اندازی بولدوزر ها برای حفر، جابجایی خاک، و هموار کردن سطح زمین:",
  },
  {
    row: 58,
    title: "مسئول پذیرش",
    question:
      "پاسخ به سوالات و کسب و ارائه اطلاعات به مشتریان، بازدید کنندگان، و سایر افراد ذینفع:",
  },
  {
    row: 59,
    title: "رواندرمانگر",
    question:
      "سنجش و درمان افراد مبتلا به مشکلات روانی، هیجانی، یا سوء مصرف مواد",
  },
  {
    row: 60,
    title: "دانشمند پژوهشگر",
    question:
      "پژوهش و مطالعه در ساختار و ویژگی های شیمیایی مواد گوناگون، برای ساخت محصولات جدید",
  },
  {
    row: 61,
    title: "برنامه نویس تجاری کامپیوتر",
    question:
      "طراحی و  نوشتن نرم افزارهای کامپیوتری با توجه به نیازهای خاص شرکتهای تجاری:",
  },
  {
    row: 62,
    title: "کلید ساز",
    question: "تعمیر، تعویض، و باز کردن قفلها، ساخت کلید ها",
  },
  {
    row: 63,
    title: "کنتور خوان",
    question:
      "خواندن شماره کنتور و ثبت میزان مصرف برق، گاز، آب در دفتر های مخصوص یا در فایل کامپیوتری",
  },
  {
    row: 64,
    title: "راهنمای تورهای تفریحی",
    question:
      "راهنمایی و همراهی افراد یا گروه ها در تورهای گردشی یا سایر اماکن گردشی",
  },
  {
    row: 65,
    title: "تحلیلگر مدیریت بازرگانی",
    question:
      "انجام فعالیتهایی مثل تجزیه و تحلیل برنامه و مشاوره مدیریتی در زمینه تجارت و کسب و کار:",
  },
  {
    row: 66,
    title: "زیست شناس",
    question:
      "پژوهش و مطالعه اصول پایه زندگی گیاهان، و حیوانات، از قبیل منشاء، روابط، رشد، کالبد شناسی، و عملکرد:",
  },
  {
    row: 67,
    title: "راننده جرثقیل",
    question:
      "کار با جرثقیل های برقی، دیزلی، یا انواع دیگر، برای جابجایی اشیاء سنگین (مثل آهن، کانتینر یا:::):",
  },
  {
    row: 68,
    title: "کارمند هتل",
    question:
      "انجام وظایفی همچون خوش آمد گویی، ثبت نام، تحویل اتاق، تنظیم پیامهای رسیده برای میهمانان هتل:",
  },
  {
    row: 69,
    title: "پزشک کودکان",
    question: "تشخیص، درمان، و کمک به پیشگیری از آسیبها و بیماری ها در کودکان",
  },
  {
    row: 70,
    title: "پزشک جراح",
    question:
      "درمان بیماریها، آسیبها، و نقایص عضوی با اقداماتی همچون، بریدن، پیوند زدن، بخیه زدن با ابزار جراحی:",
  },
  {
    row: 71,
    title: "برنامه نویس",
    question:
      "تبدیل پروژه ها و دستورالعملها  به علامتهای منطقی به منظور رمزگردانی آن به زبان کامپیوتری",
  },
  {
    row: 72,
    title: "ناظر ساخت پُل",
    question:
      "بررسی پُلها برای اطمینان از ایمنی و مطابقت آن با استاندارهای ساخت و ساز:",
  },
  {
    row: 73,
    title: "نظافتکار پنجره",
    question: "نظافت و شستشوی شیشه های بیرونی ساختمان های عمومی یا خصوصی",
  },
  {
    row: 74,
    title: "گارسون",
    question:
      "گرفتن سفارشات و آماده کردن غذا و نوشیدنی برای مشتری ها در رستورانها و اماکن مشابه با آن:",
  },
  {
    row: 75,
    title: "تحلیلگر اوضاع بازار",
    question: "بررسی اوضاع بازار جهت تعیین توان بالقوه برای فروش کالا و خدمات:",
  },
  {
    row: 76,
    title: "مردم شناس",
    question:
      "مطالعه در جنبه های مختلف زندگی انسانها مثل رشد جسمی، اجتماعی، زبانشناختی، و فرهنگی آنها",
  },
  {
    row: 77,
    title: "هرس کننده درختان",
    question:
      "بریدن شاخ و برگ اضافی درختان و گیاهان برای حفظ محدوده جاده ها و معابر یا پارک ها",
  },
  {
    row: 78,
    title: "آرایشگر یا پیرایشگر",
    question:
      "ارائه خدماتی از قبیل سرشویی، بریدن، رنگ زدن، حالت دادن و  ایجاد مد در موی سر و صورت",
  },
  {
    row: 79,
    title: "پزشک خانواده",
    question:
      "ارائه مداوم خدمات جامع پزشکی برای اعضای خانواده، صرف نظر از سن، جنس",
  },
  {
    row: 80,
    title: "متخصص ژنتیک",
    question:
      "مطالعه پدیده ها، قوانین و عوامل محیطی موثر در توارث و دگرگونی صفات در انواع موجودات زنده:",
  },
  {
    row: 81,
    title: "تحلیلگر سیستم",
    question:
      "بررسی، طراحی، توسعه، نیاز سنجی، و آزمایش نرم افزار های کامپیوتری",
  },
  {
    row: 82,
    title: "لوله کش",
    question:
      "مونتاژ، نصب، تعویض، و تعمیر خطوط یا سیستم های لوله کشی مخصوص انتقال آب و سایر مایعات و گازها:",
  },
  {
    row: 83,
    title: "سرپرست وسایل بازی",
    question:
      "راهنمایی و محافظت از مشتریان پارکهای تفریحی، هنگام استفاده از وسایل تفریحی پارک",
  },
  {
    row: 84,
    title: "قهوه چی",
    question:
      "ساخت و فروش انواع قهوه و نسکافه برای مشتری های قهوه خانه یا کافی شاپ",
  },
  {
    row: 85,
    title: "تحلیلگر سرمایه خصوصی",
    question:
      "تجزیه و تحلیل اطلاعات مالی جهت استفاده در تصمیم گیری برای سرمایه گذاری:",
  },
  {
    row: 86,
    title: "دانشمند زمین شناسی",
    question: "مطالعه در باره جوانب ویژگی های  مختلف لایه های کره زمین",
  },
  {
    row: 87,
    title: "کارگر ساختمان",
    question:
      "انجام آمیزه ای از وظایف (وظایف متغیر) در ساخت ساختمان ها یا سایر بناها:",
  },
  {
    row: 88,
    title: "متصدی پُست",
    question: "مرتب کردن و آماده کردن مرسولات پستی وارده و صادره برای توزیع",
  },
  {
    row: 89,
    title: "جامعه شناس",
    question:
      "مطالعه ویژگی های مختلف رفتار، تعاملات و آداب و رسوم افراد در یک یا چند جامعه",
  },
  {
    row: 90,
    title: "فیزیکدان",
    question:
      "انجام پژوهش های نظری یا اپراتوردی در ابعاد فیزیکی پدیده ها و ارایه نظریه بر اساس مشاهده و آزمایش",
  },
  {
    row: 91,
    title: "اپراتور کامپیوتر",
    question: "نظارت و کنترل کلیه تجهیزات اصلی و جانبی کامپیوتر",
  },
  {
    row: 92,
    title: "ناظر ساختمان",
    question:
      "نظارت بنا ها، با استفاده از مهارتهای مهندسی، جهت تعیین کنترل رعایت مقررات ساختمان سازی",
  },
  {
    row: 93,
    title: "سرپرست رخت کن",
    question:
      "مسئول امانت و محافظت از لباس ها در رخت کن سالنهای ورزشی، سالنهای ملاقات و اماکن مشابه",
  },
  {
    row: 94,
    title: "راهنمای تور مسافرتی",
    question: "سازماندهی، و  هدایت سفرهای راه دور، تورها، و اردوها",
  },
  {
    row: 95,
    title: "مدیر امور مصرف کنند گان",
    question:
      "طراحی، اجرا، و نظارت بر اجرای قوانین مرتبط با رعایت قوانین حقوق مصرف کنندگان",
  },
  {
    row: 96,
    title: "زمین شناس",
    question:
      "مطالعه بر روی پوسته زمین برای تعیین فرایندهای موثر بر رشد و تحول زمین",
  },
  {
    row: 97,
    title: "سقف ساز",
    question:
      "پوشیدن سقف بناها با قطعات سنگی، آسفالت، آلومینیوم، چوب، و مواد مربوطه",
  },
  {
    row: 98,
    title: "محافظ",
    question:
      "همراهی، محافظت از افراد در مراودات اجتماعی، گردش از امکان یا مناظر",
  },
  {
    row: 99,
    title: "مددکار روانپزشکی",
    question:
      "نظارت بر پیشرفت برنامه های درماتی برای افرادی که به نوعی با مشکلات روحی یا روانی",
  },
  {
    row: 100,
    title: "ستاره شناس",
    question:
      "مشاهده، مطالعه، و تفسیر پدیده های فلکی برای افزایش دانش پایه و اپراتوردهای دیگر:",
  },
  {
    row: 101,
    title: "مشاور کامپیوتر",
    question:
      "ارائه خدماتی همچون مشاوره، آموزش، طراحی، نصب، و مدیریت نرم افزار یا سخت افزار کامپیوتر",
  },
  {
    row: 102,
    title: "معلم کارگاه دبیرستان",
    question:
      "کمک به دانش آموزان دبیرستانی در توسعه مهارتهای کار در هنرهای صنعتی:",
  },
  {
    row: 103,
    title: "راننده اتوبوس",
    question: "رانندگی با انواع  اتوبوس یا مینی بوس ها",
  },
  {
    row: 104,
    title: "مسئول خرید شخصی",
    question:
      "خریداری کالا برای مشتریان (مغازه ها یا افراد)، مطابق با درخواستهای پستی یا تلفنی",
  },
  {
    row: 105,
    title: "دلال سهام شرکتها",
    question:
      "خرید و فروش سهام شرکتها بر مبنای نتایج اطلاعات مالی حاصل از تجزیه و تحلیل  بازار",
  },
  {
    row: 106,
    title: "شیمیدان",
    question:
      "انجام تجزیه و تحلیلهای اعداد و اطلاعات شیمیایی یا آزمایشات شیمی در آزمایشگاه",
  },
  {
    row: 107,
    title: "پیمانکار ساختمان",
    question:
      "اجرایی کردن سازه های ساختمانی خاص، مطابق با نقشه ارائه شده توسط یک مهندس معمار:",
  },
  {
    row: 108,
    title: "منشی",
    question:
      "انجام اقدامات دفتری از قبیل: پیش نویس مکاتبات، تنظیم قرار ملاقات ها، سازماندهی و نگهداری فایلهای کاغذی : ",
  },
];
